# Вывести сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
i = 1
res = 0
while i <= 100:
    res += i
    i += 1
print('Сумма чисел от 1 до 100 равна - ', res)